[
  {
    "title": "Red flags: how to avoid falling victim to a ‘money mule’ scam",
    "summary": "The article discusses the risks associated with becoming a \"money mule,\" where individuals unknowingly facilitate the transfer of illicit funds. It highlights the potential legal and financial repercussions for those involved, emphasizing the importance of awareness and caution when handling unexpected money transfers.",
    "date": "2025-09-21T06:00:35Z",
    "url": "https://www.theguardian.com/p/x386pf",
    "source": "The Guardian"
  },
  {
    "title": "‘She never got help’: mother says daughter who died on motorway was failed by care system",
    "summary": "Tamzin Hall, a 17-year-old girl, tragically died after being struck by a vehicle on the M5 motorway in Somerset, having left a police car following her arrest. Her mother claims that the care system failed her daughter, raising concerns about the support and protection available to vulnerable youth.",
    "date": "2025-09-21T06:00:36Z",
    "url": "https://www.theguardian.com/p/x37gn2",
    "source": "The Guardian"
  },
  {
    "title": "Optus CEO says ‘compulsory escalation process’ for reports of triple-zero failures to be introduced – as it happened",
    "summary": "Optus CEO announced the introduction of a \"compulsory escalation process\" to address failures in emergency service reporting, specifically regarding triple-zero calls. This move aims to enhance accountability and improve response protocols in light of previous issues.",
    "date": "2025-09-21T05:55:33Z",
    "url": "https://www.theguardian.com/p/x39b4j",
    "source": "The Guardian"
  },
  {
    "title": "Campanelle, London EC3: ‘A great illustration of the pros of working from home’ – restaurant review",
    "summary": "The review of Campanelle in London EC3 describes it as a corporate-oriented restaurant that lacks authenticity in its Italian offerings. It suggests that while the establishment has its strengths, it may not fully resonate with those seeking genuine Italian cuisine.",
    "date": "2025-09-21T05:00:34Z",
    "url": "https://www.theguardian.com/p/x37agg",
    "source": "The Guardian"
  },
  {
    "title": "I have a dirty TV secret – and there’s a 50/50 chance that you do too",
    "summary": "The article reveals that a significant portion of the UK population lies about their television viewing habits, often exaggerating their interest in documentaries or serious dramas. The author admits to being part of this trend, highlighting a societal tendency to misrepresent personal entertainment preferences.",
    "date": "2025-09-21T04:00:32Z",
    "url": "https://www.theguardian.com/p/x392ta",
    "source": "The Guardian"
  },
  {
    "title": "Britain, Australia and Canada Recognize a Palestinian State",
    "summary": "On the eve of the U.N. General Assembly, Britain, Australia, and Canada officially recognized the state of Palestine, marking a significant diplomatic move in international relations. This recognition reflects growing support for Palestinian sovereignty amid ongoing geopolitical tensions.",
    "date": "2025-09-21T09:16:10-04:00",
    "url": "https://www.nytimes.com/2025/09/21/world/europe/starmer-uk-recognize-palestinian-state.html",
    "source": "NY Times"
  },
  {
    "title": "Israel Keeps Border Crossing to Jordan Closed After Attack",
    "summary": "Following a recent attack, Israel has closed the Allenby Bridge border crossing to Jordan, which serves as a crucial exit point for Palestinians from the Israeli-occupied West Bank. The closure raises concerns about the movement and humanitarian situation for those affected.",
    "date": "2025-09-21T07:28:36-04:00",
    "url": "https://www.nytimes.com/2025/09/21/world/middleeast/israel-jordan-allenby-crossing.html",
    "source": "NY Times"
  },
  {
    "title": "Trump Is Expanding the National Guard’s Role. Some Former Generals Worry.",
    "summary": "Former generals express concern over President Trump's expansion of the National Guard's role to include domestic crime suppression, arguing that this shift could undermine the force's original mission. The debate highlights tensions regarding the military's involvement in civil matters.",
    "date": "2025-09-21T05:00:17-04:00",
    "url": "https://www.nytimes.com/2025/09/21/us/national-guard-crime-washington-cities.html",
    "source": "NY Times"
  },
  {
    "title": "For Erika Kirk, a Husband’s Life Cut Short by Violence He Seemed to Foresee",
    "summary": "Erika Kirk reflects on her husband Charlie Kirk's violent death, revealing that she had urged him to take precautions like wearing a bulletproof vest. Despite the tragedy, she finds solace in believing that there is a divine purpose behind his untimely passing.",
    "date": "2025-09-21T05:02:38-04:00",
    "url": "https://www.nytimes.com/2025/09/21/us/politics/erika-kirk.html",
    "source": "NY Times"
  },
  {
    "title": "What Dwayne ‘The Rock’ Johnson Knows About Pain",
    "summary": "In \"The Smashing Machine,\" Dwayne ‘The Rock’ Johnson delivers a unique performance that challenges him to confront his fears. The article explores the emotional depth of his role and the personal growth he",
    "date": "2025-09-21T05:00:47-04:00",
    "url": "https://www.nytimes.com/2025/09/21/magazine/dwayne-johnson-the-rock-smashing-machine.html",
    "source": "NY Times"
  }
]