[
  {
    "text": "Flight delays continue across Europe after weekend cyber-attack: A cyber-attack over the weekend has led to ongoing flight delays across Europe, affecting major airports including Heathrow, Brussels, and Berlin. Collins Aerospace, the software provider involved, is currently completing updates to resolve the issues. The incident highlights vulnerabilities in aviation infrastructure and the potential impact of cyber threats on travel.",
    "date": "2025-09-22T11:19:09Z",
    "url": "https://www.theguardian.com/p/x39ttf",
    "source": "The Guardian"
  },
  {
    "text": "Met police investigate possible vetting errors over 300 recruits: The Metropolitan Police are investigating possible vetting errors concerning over 300 recruits, examining whether they underwent inadequate or no background checks before joining the force. This inquiry raises concerns about the integrity of police recruitment processes and public trust in law enforcement.",
    "date": "2025-09-22T09:09:34Z",
    "url": "https://www.theguardian.com/p/x38tc8",
    "source": "The Guardian"
  },
  {
    "text": "UN and rights groups condemn reported jailing of Wuhan Covid citizen journalist: The United Nations and various human rights groups have condemned the sentencing of Wuhan citizen journalist Zhang Zhan to four years in prison for charges often used by China to suppress dissent. Her case underscores ongoing concerns regarding freedom of expression and the treatment of whistleblowers in China.",
    "date": "2025-09-22T11:23:21Z",
    "url": "https://www.theguardian.com/p/x39jaf",
    "source": "The Guardian"
  },
  {
    "text": "Insolvent UK recruiter acquired by previous owner who took millions out: Premier Group Recruitment, a UK recruitment agency, has been acquired by its previous owner after going into administration with debts totaling £2.9 million, including significant tax liabilities. The acquisition raises questions about corporate responsibility and the management of financial distress in the recruitment industry.",
    "date": "2025-09-22T12:10:01Z",
    "url": "https://www.theguardian.com/p/x38dkh",
    "source": "The Guardian"
  },
  {
    "text": "Premier League: 10 talking points from the weekend’s action: This weekend's Premier League action saw Aston Villa continue to struggle, West Ham face further challenges, and Brighton manage player Carlos Baleba with care. The outcomes of these matches are significant as they impact team standings and strategies moving forward in the season.",
    "date": "2025-09-22T07:00:06Z",
    "url": "https://www.theguardian.com/p/x39f32",
    "source": "The Guardian"
  },
  {
    "text": "The Firing of Educators Over Kirk Comments Follows a Familiar Playbook: Conservative efforts to challenge and penalize educators for liberal viewpoints have intensified, with notable involvement from Charlie Kirk, a prominent figure in these campaigns. This trend reflects broader cultural and political battles over educational content and ideological influence in schools.",
    "date": "2025-09-22T10:10:02-04:00",
    "url": "https://www.nytimes.com/2025/09/22/us/firing-educators-kirk-free-speech.html",
    "source": "NY Times"
  },
  {
    "text": "How to Silence Dissent, Bit by Bit Until Fear Takes Over: In China, the initial opening of journalism and public debate has been systematically curtailed under a new leadership, employing various tactics to control speech and suppress dissent. This shift illustrates the ongoing erosion of civil liberties and the chilling effect on free expression in the country.",
    "date": "2025-09-22T12:01:38-04:00",
    "url": "https://www.nytimes.com/2025/09/22/business/china-censorship-jimmy-kimmel.html",
    "source": "NY Times"
  },
  {
    "text": "U.S.-Run TikTok to License Algorithm, White House Says: The White House announced that TikTok, now run by a U.S. entity, will license its algorithm as part of an effort to avert a potential ban on the app. This move signifies the U.S. government's ongoing scrutiny of foreign technology and its implications for national security.",
    "date": "2025-09-22T11:21:05-04:00",
    "url": "https://www.nytimes.com/2025/09/22/us/politics/tiktok-deal-algorithm-trump.html",
    "source": "NY Times"
  },
  {
    "text": "Trump’s Fed Pick Outlines Case for Slashing Interest Rates: Stephen Miran, a recent appointee to the Federal Reserve, has proposed a reduction in interest rates to around 2.5 percent, suggesting that current rates are too high. His stance could influence monetary policy debates and economic strategies moving forward.",
    "date": "2025-09-22T12:00:15-04:00",
    "url": "https://www.nytimes.com/2025/09/22/business/trump-fed-interest-rates.html",
    "source": "NY Times"
  },
  {
    "text": "Trump Appointees Roll Back Enforcement of Fair Housing Laws: Interviews and internal documents reveal that Trump appointees are rolling back enforcement of fair housing laws, dismissing these civil rights protections as ideologically motivated. This development raises concerns about the future of housing equality and civil rights in the U.S.",
    "date": "2025-09-22T05:05:10-04:00",
    "url": "https://www.nytimes.com/2025/09/22/realestate/trump-fair-housing-laws.html",
    "source": "NY Times"
  },
  {
    "text": "News Today Live Updates, 22 September | ‘Police claims of innocence can’t be accepted at this state’ – Kathua court orders FIR in custodial ‘torture’ case: In a recent court hearing, a Kathua court ordered the registration of a First Information Report (FIR) regarding allegations of custodial torture by police against two laborers from Pathankot. This case highlights issues of police accountability and human rights within the judicial system.",
    "date": "2025-09-22",
    "url": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-09-22-2025-news-headlines-10263712/&ved=2ahUKEwiG55Dw5uyPAxXaEhAIHbwkLrAQxfQBegQIBxAC&usg=AOvVaw3spCpEpeJKwjjTBtbTlT4Q",
    "source": [
      "Google News",
      "The Indian Express"
    ]
  },
  {
    "text": "Crystal Palace Set to Reject Liverpool and Real Madrid’s Star Bids: Crystal Palace is reportedly set to reject transfer bids from Liverpool and Real Madrid for one of their star players, emphasizing the club's commitment to retaining key talent. This decision reflects the competitive nature of the football transfer market.",
    "date": "2025-09-22",
    "url": "https://berawangnews.com/report-crystal-palace-expected-to-resist-bids-as-liverpool-and-real-madrid-circle-england-star-2/&ved=2ahUKEwiG55Dw5uyPAxXaEhAIHbwkLrAQxfQBegQIAhAC&usg=AOvVaw326JQ5ei9EFAShuYUT54kO",
    "source": [
      "Google News",
      "Berawang News"
    ]
  },
  {
    "text": "Breaking News Live: MHA declares National Socialist Council of Nagaland (Khaplang) as unlawful association for 5 years: The Ministry of Home Affairs in India has declared the National Socialist Council of Nagaland (Khaplang) an unlawful association for five years, a move that underscores ongoing efforts to combat insurgency and maintain national security. This designation may impact regional stability and governance.",
    "date": "2025-09-22",
    "url": "https://timesofindia.indiatimes.com/india/latest-india-world-news-live-updates-today-breaking-news-september-22-2025/liveblog/124032919.cms&ved=2ahUKEwiG55Dw5uyPAxXaEhAIHbwkLrAQxfQBegQIChAC&usg=AOvVaw0DEmdvfLUwdmIsDyendFRD",
    "source": [
      "Google News",
      "Times of India"
    ]
  },
  {
    "text": "‘That Point Could Be Massive’ – Rooney Defends Arsenal Draw: Wayne Rooney defended the significance of Arsenal's recent draw, suggesting that the point could be crucial in the context of the season. His comments reflect the strategic importance of every match in competitive football.",
    "date": "2025-09-22",
    "url": "https://berawangnews.com/that-point-could-be-massive-rooney-defends-arsenal-draw/&ved=2ahUKEwiG55Dw5uyPAxXaEhAIHbwkLrAQxfQBegQICRAC&usg=AOvVaw15mA96rOAEgd8evZdXMswC",
    "source": [
      "Google News",
      "Berawang News"
    ]
  },
  {
    "text": "Breaking: Final Witness Statements Recorded in Tosha Khana II Case | Imran Khan & Bushra Bibi: Final witness statements have been recorded in the Tosha Khana II case involving Imran Khan and Bushra Bibi, as the prosecution continues its proceedings. This case is closely watched in Pakistan, highlighting the intersection of politics and legal accountability.",
    "date": "2025-09-22",
    "url": "https://www.youtube.com/watch%3Fv%3DC0euNcJptEQ&ved=2ahUKEwiG55Dw5uyPAxXaEhAIHbwkLrAQxfQBegQIBBAC&usg=AOvVaw05N8abHWcA5UWajnX72WbI",
    "source": [
      "Google News",
      "YouTube"
    ]
  }
]