[
  {
    "text": "Red flags: how to avoid falling victim to a ‘money mule’ scam: The Guardian highlights the risks associated with money mule scams, where individuals unknowingly facilitate the transfer of illicit funds. Victims can face severe legal and financial repercussions, emphasizing the importance of awareness and vigilance in financial transactions.",
    "date": "2025-09-21T06:00:35Z",
    "url": "https://www.theguardian.com/p/x386pf",
    "source": "The Guardian"
  },
  {
    "text": "NT attorney general criticised after confirming family link to hit-and-run driver: Marie-Clare Boothby, the NT attorney general, is under scrutiny after disclosing her familial connection to a hit-and-run driver who avoided prison for killing an Aboriginal pedestrian. This revelation raises ethical questions regarding her position and the implications of her relationship with the driver.",
    "date": "2025-09-21T01:37:31Z",
    "url": "https://www.theguardian.com/p/x39b9t",
    "source": "The Guardian"
  },
  {
    "text": "Campanelle, London EC3: ‘A great illustration of the pros of working from home’ – restaurant review: A review of Campanelle, a corporate-focused restaurant in London, describes it as a representation of the advantages of remote work but critiques its authenticity and connection to Italian cuisine. The establishment caters primarily to business clientele, reflecting a trend in dining preferences.",
    "date": "2025-09-21T05:00:34Z",
    "url": "https://www.theguardian.com/p/x37agg",
    "source": "The Guardian"
  },
  {
    "text": "Tulip Siddiq fears plans to use ‘fake’ documents to secure conviction in corruption trial: Tulip Siddiq, an ex-minister on trial in absentia in Bangladesh, has expressed concerns about the legitimacy of evidence presented against her, claiming that the ID card and passport used are not hers. This raises issues regarding the integrity of the judicial process in her case.",
    "date": "2025-09-21T07:00:36Z",
    "url": "https://www.theguardian.com/p/x393p3",
    "source": "The Guardian"
  },
  {
    "text": "‘She never got help’: mother says daughter who died on motorway was failed by care system: The mother of Tamzin Hall, a 17-year-old who died on a motorway after leaving police custody, claims that the care system failed her daughter. This tragic incident highlights systemic issues in the treatment of vulnerable youth within the justice and care systems.",
    "date": "2025-09-21T06:00:36Z",
    "url": "https://www.theguardian.com/p/x37gn2",
    "source": "The Guardian"
  },
  {
    "text": "Britain, Australia and Canada Recognize a Palestinian State: Britain, Australia, and Canada have officially recognized a Palestinian state, coinciding with the U.N. General Assembly's annual gathering. This move is significant in the context of international relations and the ongoing Israeli-Palestinian conflict.",
    "date": "2025-09-21T09:16:10-04:00",
    "url": "https://www.nytimes.com/2025/09/21/world/europe/starmer-uk-recognize-palestinian-state.html",
    "source": "NY Times"
  },
  {
    "text": "Israel Keeps Border Crossing to Jordan Closed After Attack: Following an attack, Israel has kept the Allenby Bridge border crossing to Jordan closed, which is a critical exit point for Palestinians from the Israeli-occupied West Bank. This closure underscores ongoing tensions and security concerns in the region.",
    "date": "2025-09-21T07:28:36-04:00",
    "url": "https://www.nytimes.com/2025/09/21/world/middleeast/israel-jordan-allenby-crossing.html",
    "source": "NY Times"
  },
  {
    "text": "Trump Is Expanding the National Guard’s Role. Some Former Generals Worry.: Former military leaders express concerns over President Trump's decision to expand the National Guard's role in responding to domestic crises, particularly in crime reduction efforts in U.S. cities. They warn that this shift may compromise the Guard's original mission and effectiveness.",
    "date": "2025-09-21T05:00:17-04:00",
    "url": "https://www.nytimes.com/2025/09/21/us/national-guard-crime-washington-cities.html",
    "source": "NY Times"
  },
  {
    "text": "For Erika Kirk, a Husband’s Life Cut Short by Violence He Seemed to Foresee: In an interview, Erika Kirk reflects on the violent death of her husband, conservative activist Charlie Kirk, noting her warnings about his safety. She interprets his death as part of a larger divine plan, illustrating the personal impact of violence in political activism.",
    "date": "2025-09-21T05:02:38-04:00",
    "url": "https://www.nytimes.com/2025/09/21/us/politics/erika-kirk.html",
    "source": "NY Times"
  },
  {
    "text": "What Dwayne ‘The Rock’ Johnson Knows About Pain: Dwayne ‘The Rock’ Johnson's performance in “The Smashing Machine” challenges him to confront his fears, offering a new dimension to his acting career. The film explores themes of pain and resilience",
    "date": "2025-09-21T05:00:47-04:00",
    "url": "https://www.nytimes.com/2025/09/21/magazine/dwayne-johnson-the-rock-smashing-machine.html",
    "source": "NY Times"
  }
]