[
  {
    "text": "Esther Manito review – disjointed dispatches from the frontline of family life: Esther Manito's standup review highlights her effective material on middle-aged issues but notes that the performance lacks cohesion, resulting in a disjointed experience for the audience. The review reflects on the challenges of connecting various comedic routines into a unified narrative.",
    "date": "2025-09-21T10:17:39Z",
    "url": "https://www.theguardian.com/p/x39djj",
    "source": "The Guardian"
  },
  {
    "text": "Owner of Georgian broadcaster called country’s ‘propaganda megaphone’ is based in London: The owner of Imedi TV, a Georgian broadcaster criticized by the EU for being a \"propaganda megaphone,\" defends its editorial independence while being based in London. This controversy raises questions about media integrity and the influence of external ownership on local journalism.",
    "date": "2025-09-21T06:00:36Z",
    "url": "https://www.theguardian.com/p/x38j35",
    "source": "The Guardian"
  },
  {
    "text": "‘Not enough in itself’: wary welcome in West Bank over recognition of Palestine: In the West Bank, residents express skepticism about the significance of the UK and others recognizing Palestine, calling for this symbolic act to lead to practical improvements in their daily lives. The move is seen as a step forward, but locals emphasize the need for tangible benefits.",
    "date": "2025-09-21T12:48:09Z",
    "url": "https://www.theguardian.com/p/x39e6d",
    "source": "The Guardian"
  },
  {
    "text": "‘She never got help’: mother says daughter who died on motorway was failed by care system: Tamzin Hall, a 17-year-old who died after leaving a police car on a motorway, is described by her mother as having been failed by the care system. The incident raises concerns about the treatment of vulnerable youth in the justice system.",
    "date": "2025-09-21T06:00:36Z",
    "url": "https://www.theguardian.com/p/x37gn2",
    "source": "The Guardian"
  },
  {
    "text": "Optus CEO says ‘compulsory escalation process’ for reports of triple-zero failures to be introduced – as it happened: Optus CEO announced the introduction of a \"compulsory escalation process\" for reporting failures related to emergency triple-zero calls. This decision follows scrutiny over the company's handling of such critical incidents.",
    "date": "2025-09-21T05:55:33Z",
    "url": "https://www.theguardian.com/p/x39b4j",
    "source": "The Guardian"
  },
  {
    "text": "Britain, Australia and Canada Recognize a Palestinian State: Britain, Australia, and Canada have officially recognized a Palestinian state, coinciding with the UN General Assembly's annual gathering. This recognition is seen as a significant diplomatic shift in the ongoing Israeli-Palestinian conflict.",
    "date": "2025-09-21T09:16:10-04:00",
    "url": "https://www.nytimes.com/2025/09/21/world/europe/starmer-uk-recognize-palestinian-state.html",
    "source": "NY Times"
  },
  {
    "text": "Israel Keeps Border Crossing to Jordan Closed After Attack: Following an attack, Israel has kept the Allenby Bridge border crossing to Jordan closed, which is a crucial exit point for Palestinians from the West Bank. The closure raises concerns about access and mobility for those affected by the situation.",
    "date": "2025-09-21T07:28:36-04:00",
    "url": "https://www.nytimes.com/2025/09/21/world/middleeast/israel-jordan-allenby-crossing.html",
    "source": "NY Times"
  },
  {
    "text": "Trump Is Expanding the National Guard’s Role. Some Former Generals Worry.: Former generals express concern over President Trump's expansion of the National Guard's role to include domestic crime response, arguing that this shift could undermine the force's mission and effectiveness. The change reflects ongoing debates about the military's involvement in civilian matters.",
    "date": "2025-09-21T05:00:18-04:00",
    "url": "https://www.nytimes.com/2025/09/21/us/national-guard-crime-washington-cities.html",
    "source": "NY Times"
  },
  {
    "text": "For Erika Kirk, a Husband’s Life Cut Short by Violence He Seemed to Foresee: Erika Kirk discusses her late husband Charlie Kirk's premonitions about violence and her belief in a divine purpose behind his death. This personal reflection sheds light on the emotional aftermath of violence and its impact on families.",
    "date": "2025-09-21T05:02:38-04:00",
    "url": "https://www.nytimes.com/2025/09/21/us/politics/erika-kirk.html",
    "source": "NY Times"
  },
  {
    "text": "In Assault on Free Speech, Trump Targets Speech He Hates: President Trump's criticisms of negative media coverage are seen as undermining the justifications provided by his administration for such complaints. This dynamic raises questions about the relationship between leadership and the press.",
    "date": "2025-09-21T10:04:35-04:00",
    "url": "https://www.nytimes.com/2025/09/21/us/politics/trump-free-speech.html",
    "source": "NY Times"
  },
  {
    "text": "News Today Live Updates, 21 September | 2-year-old toddler dies after falling into an open drain in Giridih, he was out shopping with his parents: A two-year-old toddler tragically died after falling into an open drain in Giridih, which was left uncovered by municipal authorities during Durga Puja preparations. The incident highlights concerns regarding public safety and infrastructure management.",
    "date": "2025-09-21",
    "url": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-09-21-2025-news-headlines-10262135/&ved=2ahUKEwibqquEkuqPAxUPJRAIHcG6JCsQxfQBegQIARAC&usg=AOvVaw2kDkN3eh_tQmgNjQxOMkUK",
    "source": [
      "Google News",
      "The Indian Express"
    ]
  },
  {
    "text": "Pakistan vs India match teams in full preparation | Breaking News | Geo News: Teams from Pakistan and India are reportedly in full preparation for an upcoming cricket match, generating excitement among fans. The rivalry is characterized as a \"high-voltage clash,\" underscoring the significance of cricket in both nations.",
    "date": "2025-09-21",
    "url": "https://www.youtube.com/watch%3Fv%3DK0ez25ewoiE&ved=2ahUKEwibqquEkuqPAxUPJRAIHcG6JCsQxfQBegQIAhAC&usg=AOvVaw0NxYetoK7o8fo48XmGvTAw",
    "source": [
      "Google News",
      "YouTube"
    ]
  },
  {
    "text": "Breaking News LIVE: 'Follow Path of Self-reliance', Says PM Modi In Big 'Swadeshi' Push Ahead of Navratri: Ahead of Navratri, Prime Minister Modi emphasizes the importance of self-reliance in a new \"Swadeshi\" push. This initiative aims to promote local industries and reduce dependence on foreign goods.",
    "date": "2025-09-21",
    "url": "https://www.timesnownews.com/india/today-latest-breaking-news-in-india-live-updates-september-21-2025-india-news-world-news-city-news-assam-news-solar-eclipse-updates-liveblog-152864100&ved=2ahUKEwibqquEkuqPAxUPJRAIHcG6JCsQxfQBegQIChAC&usg=AOvVaw0Ws6toEotBRU5bmRRipPKA",
    "source": [
      "Google News",
      "Times Now"
    ]
  },
  {
    "text": "Tennessee Titans vs. Indianapolis Colts: Live coverage, breaking news, highlights: Live coverage and highlights of the Week 3 NFL game between the Tennessee Titans and Indianapolis Colts are being provided. Fans can follow the action as both teams compete on the field.",
    "date": "2025-09-21",
    "url": "https://titanswire.usatoday.com/story/sports/nfl/titans/2025/09/21/tennessee-titans-indianapolis-colts-week-3-afc-south-recap-score-live/86276530007/&ved=2ahUKEwibqquEkuqPAxUPJRAIHcG6JCsQxfQBegQICRAC&usg=AOvVaw1J2s_MkBc2S-KPTV0140Jz",
    "source": [
      "Google News",
      "Titans Wire"
    ]
  },
  {
    "text": "Today’s Wordle #1556: Hints And Answer For September 22, 2025: Today's Wordle #1556 offers hints and the answer for players engaged in the popular word puzzle game. The ongoing appeal of Wordle continues to captivate a global audience.",
    "date": "2025-09-21",
    "url": "https://berawangnews.com/todays-wordle-1556-hints-and-answer-for-september-22-2025/&ved=2ahUKEwibqquEkuqPAxUPJRAIHcG6JCsQxfQBegQICBAC&usg=AOvVaw0oagoSC7uPtV0nC-7rYaBW",
    "source": [
      "Google News",
      "Berawang News"
    ]
  }
]